import math

# 第一步：使用python的字典dict构造数据集
movie_data = {"宝贝当家": [45, 2, 9, "喜剧片"],
              "美人鱼": [21, 17, 5, "喜剧片"],
              "澳门风云3": [54, 9, 11, "喜剧片"],
              "功夫熊猫3": [39, 0, 31, "喜剧片"],
              "谍影重重": [5, 2, 57, "动作片"],
              "叶问3": [3, 2, 65, "动作片"],
              "伦敦沦陷": [2, 3, 55, "动作片"],
              "我的特工爷爷": [6, 4, 21, "动作片"],
              "奔爱": [7, 46, 4, "爱情片"],
              "夜孔雀": [9, 39, 8, "爱情片"],
              "代理情人": [9, 38, 2, "爱情片"],
              "新步步惊心": [8, 34, 17, "爱情片"]}

# 第二步：计算一个新样本与数据集中所有数据的距离
x = [23, 3, 17]  # 假定唐人街探案电影数据特征
KNN = []
k = 5
for K, v in movie_data.items():
    distance = math.sqrt((v[0] - x[0]) ** 2 + (v[1] - x[1]) ** 2 + (v[2] - x[2]) ** 2)
    KNN.append([distance, v[3]])

# 第三部：排序后的KNN，并取出前五个
KNN = sorted(KNN, key=lambda x: x[0])[:k]

# 第四步：取出前五个的电影类型
tp_list = [v[1] for v in KNN]

# 第五步：求出列表中每个元素出现的次数
tp_dirt = {}
for i in tp_list:
    tp_dirt[i] = tp_dirt.get(i, 0) + 1

# 第六步：求出字典的最大值
result = max(tp_dirt, key=lambda key: tp_dirt[key])
print("唐人街探案电影类型为：", result)
